## Data cleaning
After inspecting the data, I discovered that there were 8 missing values in the "UNIT PRICE" column. To address this, I calculated the mean unit price for the products with NaN values and used this mean to fill in the missing entries. Next, I dropped the rows that still contained NaN values, assuming they were erroneous entries.

I also checked for duplicate records and found 3,424 duplicates, which I subsequently removed from the dataset. Finally, I reformatted the "DATE" column from object type to datetime dtype, and converted "UNIT PRICE" and "QUANTITY" from object type to integer.

In [1]:
import pandas as pd

In [2]:
#import data
df = pd.read_csv(r"C:\Users\jay\Desktop\Kwanza Tukule\Case Study Data.csv", thousands = ",")

In [3]:
df.shape
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 333405 entries, 0 to 333404
Data columns (total 7 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   DATE                 333405 non-null  object
 1   ANONYMIZED CATEGORY  333405 non-null  object
 2   ANONYMIZED PRODUCT   333405 non-null  object
 3   ANONYMIZED BUSINESS  333405 non-null  object
 4   ANONYMIZED LOCATION  333405 non-null  object
 5   QUANTITY             333405 non-null  int64
 6   UNIT PRICE           333397 non-null  float64
dtypes: float64(1), int64(1), object(5)
memory usage: 17.8+ MB

In [7]:
df[df.isna().any(axis=1)]

,DATE,ANONYMIZED CATEGORY,ANONYMIZED PRODUCT,ANONYMIZED BUSINESS,ANONYMIZED LOCATION,QUANTITY,UNIT PRICE
108112,"July 3, 2024, 5:53 PM",Category-94,Product-3d7f,Business-4fce,Location-f37d,2,NaN
150961,"December 16, 2024, 6:33 PM",Category-79,Product-dfc8,Business-8bbf,Location-3fc0,1,NaN
151142,"December 22, 2024, 2:42 PM",Category-122,Product-15e0,Business-c575,Location-1979,3,NaN
272379,"June 27, 2024, 12:15 PM",Category-92,Product-ccbc,Business-14b6,Location-1979,1,NaN
278284,"August 14, 2024, 9:09 PM",Category-101,Product-84a5,Business-4be1,Location-bb69,21,NaN
278384,"December 30, 2024, 2:17 PM",Category-95,Product-15f3,Business-1a74,Location-f37d,1,NaN
310385,"March 31, 2024, 2:03 PM",Category-114,Product-9204,Business-c9dc,Location-689f,1,NaN
327152,"August 13, 2024, 4:20 PM",Category-107,Product-7eed,Business-0d61,Location-1ba8,1,NaN

In [9]:
# Step 1: Calculate the mean UNIT PRICE for each ANONYMIZED PRODUCT
mean_prices = df.groupby("ANONYMIZED PRODUCT")["UNIT PRICE"].mean()

# Step 2: Fill NaN values in UNIT PRICE using the mean prices
df["UNIT PRICE"] = df.apply(
    lambda row: mean_prices[row["ANONYMIZED PRODUCT"]] if pd.isna(row["UNIT PRICE"]) else row["UNIT PRICE"], 
    axis=1
)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 333405 entries, 0 to 333404
Data columns (total 7 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   DATE                 333405 non-null  object
 1   ANONYMIZED CATEGORY  333405 non-null  object
 2   ANONYMIZED PRODUCT   333405 non-null  object
 3   ANONYMIZED BUSINESS  333405 non-null  object
 4   ANONYMIZED LOCATION  333405 non-null  object
 5   QUANTITY             333405 non-null  int64
 6   UNIT PRICE           333402 non-null  float64
dtypes: float64(1), int64(1), object(5)
memory usage: 17.8+ MB

In [13]:
# Drop the remaining nan values since there are no similar products to use to fill the unit price
df.dropna(inplace = True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 333402 entries, 0 to 333404
Data columns (total 7 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   DATE                 333402 non-null  object
 1   ANONYMIZED CATEGORY  333402 non-null  object
 2   ANONYMIZED PRODUCT   333402 non-null  object
 3   ANONYMIZED BUSINESS  333402 non-null  object
 4   ANONYMIZED LOCATION  333402 non-null  object
 5   QUANTITY             333402 non-null  int64
 6   UNIT PRICE           333402 non-null  float64
dtypes: float64(1), int64(1), object(5)
memory usage: 20.3+ MB

In [57]:
#convert DATE column to datetime data type
df['DATE'] = pd.to_datetime(df['DATE'], format='%B %d, %Y, %I:%M %p')

In [21]:
#convert unit price to type int
df["UNIT PRICE"] = df["UNIT PRICE"].astype(int)

In [23]:
df.info()
df.shape

<class 'pandas.core.frame.DataFrame'>
Index: 333402 entries, 0 to 333404
Data columns (total 7 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   DATE                 333402 non-null  datetime64[ns]
 1   ANONYMIZED CATEGORY  333402 non-null  object
 2   ANONYMIZED PRODUCT   333402 non-null  object
 3   ANONYMIZED BUSINESS  333402 non-null  object
 4   ANONYMIZED LOCATION  333402 non-null  object
 5   QUANTITY             333402 non-null  int64
 6   UNIT PRICE           333402 non-null  int32
dtypes: datetime64[ns](1), int32(1), int64(1), object(4)
memory usage: 19.1+ MB

(333402, 7)

In [29]:
duplicate = df.duplicated()
duplicated_rows = df[duplicate]
duplicated_rows

,DATE,ANONYMIZED CATEGORY,ANONYMIZED PRODUCT,ANONYMIZED BUSINESS,ANONYMIZED LOCATION,QUANTITY,UNIT PRICE
6153,2024-01-06 11:52:00,Category-91,Product-1b48,Business-20fc,Location-b125,1,3680
7554,2024-07-09 14:26:00,Category-104,Product-af50,Business-476c,Location-b27b,1,1310
7555,2024-07-09 14:26:00,Category-92,Product-d09a,Business-476c,Location-b27b,1,1550
12238,2024-04-19 15:19:00,Category-75,Product-086d,Business-b48e,Location-03fc,3,2090
12239,2024-04-19 15:19:00,Category-106,Product-21f4,Business-b48e,Location-03fc,2,850
...,...,...,...,...,...,...,...
333133,2024-02-01 09:17:00,Category-111,Product-7fac,Business-4919,Location-3e32,3,814
333134,2024-02-01 09:17:00,Category-77,Product-d09c,Business-4919,Location-3e32,1,3200
333350,2024-06-10 22:08:00,Category-76,Product-e805,Business-54ad,Location-3e32,5,5965
333399,2024-01-09 20:49:00,Category-97,Product-bbdc,Business-f9ff,Location-1979,1,341
333400,2024-01-09 20:49:00,Category-119,Product-e98d,Business-f9ff,Location-1979,1,1770

In [33]:
#drop duplicate entries
df.drop_duplicates(inplace = True)

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 329878 entries, 0 to 333404
Data columns (total 8 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   DATE                 329878 non-null  object
 1   ANONYMIZED CATEGORY  329878 non-null  object
 2   ANONYMIZED PRODUCT   329878 non-null  object
 3   ANONYMIZED BUSINESS  329878 non-null  object
 4   ANONYMIZED LOCATION  329878 non-null  object
 5   QUANTITY             329878 non-null  int64
 6   UNIT PRICE           329878 non-null  int32
 7   Month_Year           329878 non-null  object
dtypes: int32(1), int64(1), object(6)
memory usage: 21.4+ MB

In [59]:
#Create the month year column
df["Month_Year"] = df["DATE"].dt.to_period("M")

In [61]:
df.head(1)

,DATE,ANONYMIZED CATEGORY,ANONYMIZED PRODUCT,ANONYMIZED BUSINESS,ANONYMIZED LOCATION,QUANTITY,UNIT PRICE,Month_Year
0,2024-08-18 21:32:00,Category-106,Product-21f4,Business-de42,Location-1ba8,1,850,2024-08

In [63]:
df.to_csv(r"C:\Users\jay\Desktop\Kwanza Tukule\Cleaned_data.csv", index = False)